{"covault":{"heading":"Covault Technologies","subheading":"Developer (Full Stack)","description":"I am a developer at Covault Technologies, where I implement features for our co-op advertising platform. I work on multiple codebases: Our Javascript/React frontend, our Elixir/Pheonix backend, and others. I\'m responsible for reliably and consistently shipping code that adds value to our business. I\'m most proud of the many innovative patterns I\'ve pioneered in our codebases that generalize common patterns into small template languages, almost like domain-specific languages. I code in an terse, functional style that reduces lines of code and makes full use of a language\'s features.","times":"April 2018 - Present","disciplines":["_react","elixir","git","css"],"slug":"covault","extension":"jpg","hasImage":true,"links":[{"link":"http://go.covaultinc.com","description":"Covault Home"},{"link":"https://staging.covaultapp.com","description":"Covault App Staging"}],"photoDescription":"Covault connects dealerships to co-op funds and to media buying campaigns."},"reelgood":{"heading":"Reelgood","subheading":"Web Developer","description":"Reelgood keeps track of your favourite shows and streaming services that you\'re subscribed to. I was a full-time web developer at Reelgood for one year. I mostly wrote front end components with React and Redux. We used the RXJS library and epics to interact with tens of APIs that provided search results, handled user auth and email tokens, updated user preferences, and so on. I wrote the playback mechanism, a library that takes the user\'s watched episodes and selected services and determines what link to open when the user hits play on a given show episode or movie.","times":"March 2017 - March 2018","disciplines":["_react","git","css"],"slug":"reelgood","extension":"png","hasImage":true,"links":[{"link":"https://reelgood.com","description":"Reelgood Home"},{"link":"https://reelgood.com/about","description":"Reelgood About Page"}],"photoDescription":"Reelgood - All your streaming services in one place."},"leanpub":{"heading":"Leanpub","subheading":"Junior Developer","description":"I spent eight months on co-op as a junior dev at Ruboss, the Victoria-based company behind Leanpub. I learned React and Ruby on Rails, and sometimes wrote useful code. This is where I cut my teeth on web development.","times":"April 2016 - December 2016","disciplines":["_react","rails","git","css"],"slug":"leanpub","extension":"png","hasImage":true,"links":[{"link":"https://leanpub.com","description":"Leanpub Home"},{"link":"https://reelgood.com/p","description":"Leanpub for Publishers"}],"photoDescription":"Leanpub - A powerful platform for serious authors."},"uvic":{"heading":"3rd Year B.Sc.","subheading":"Mathematics & Computer Science","description":"I\'m 12 courses away from a degree in Mathematics and Computer Science (combined single major) from UVic. I started at Thompson Rivers University in 2013 as Mathematics major, then transferred to UVic at the end of my 2nd year, and added a Computer Science component to my degree. I\'m most interested in applied mathematics and software engineering.","slug":"uvic","disciplines":["school"],"times":"September 2012 - Present","extension":"png","hasImage":true,"photoDescription":"My courses.","links":[]},"cppsnake":{"heading":"C++ Battlesnake","subheading":"Using Monte-Carlo tree search","times":"March 2018","description":"This is an AI that I wrote for Battlesnake 2018. It receives a board state and then uses Monte Carlo tree search (with UCB1-Tuned selection policy) to decide on the next move. The snake is written in C++, and was the second snake I made in 2018. The first snake I coded was in Lua. I knew Lua was fast thanks to Mike Palls LuaJIT, but after looking at some benchmarks and seeing that C++ was actually hundreds of times faster, I knew that I needed to switch languages. In my code, I make heavy use of the Boost Graph Library and a JSON library. I expose the snake as a FastCGI app on port 88. Check the repository for build/deploy details.","hasImage":false,"sl
